In [41]:
#Aula 2

In [42]:
# Bibliotecas

import pandas as pd

In [43]:
# Processamento de dados

dicionario = {'A': [1,2,3],
              'B': [-3,-2,-1],
              'C': [0,10,20]}

label = ['1 Linha', '2 Linha', '3 Linha']

df_01 = pd.DataFrame(dicionario, index=label)

In [44]:
print(df_01)

         A  B   C
1 Linha  1 -3   0
2 Linha  2 -2  10
3 Linha  3 -1  20

In [45]:
df_01[['A', 'C']]

         A   C
1 Linha  1   0
2 Linha  2  10
3 Linha  3  20

In [46]:
df_01['D'] = df_01['A']*df_01['B']
print(df_01)

         A  B   C  D
1 Linha  1 -3   0 -3
2 Linha  2 -2  10 -4
3 Linha  3 -1  20 -3

In [47]:
df_01.drop('D', axis=1)
print(df_01)

         A  B   C  D
1 Linha  1 -3   0 -3
2 Linha  2 -2  10 -4
3 Linha  3 -1  20 -3

In [48]:
df_01.drop('D', axis=1, inplace=True)
print(df_01)

         A  B   C
1 Linha  1 -3   0
2 Linha  2 -2  10
3 Linha  3 -1  20

In [49]:
df_01.loc['2 Linha']

A     2
B    -2
C    10
Name: 2 Linha, dtype: int64

In [50]:
df_01.loc[['1 Linha', '2 Linha'], ['A', 'B']]

         A  B
1 Linha  1 -3
2 Linha  2 -2

In [51]:
df_01.iloc[1:2, 0:2]

         A  B
2 Linha  2 -2

In [52]:
filtro = df_01['C']>0
df_02 = df_01[filtro]
print(df_02)

         A  B   C
2 Linha  2 -2  10
3 Linha  3 -1  20

In [54]:
df_01>0

            A      B      C
1 Linha  True  False  False
2 Linha  True  False   True
3 Linha  True  False   True

In [55]:
df_01[(df_01['A']>1)& (df_01['C']>0)]

         A  B   C
2 Linha  2 -2  10
3 Linha  3 -1  20

In [56]:
df_01[(df_01['A']>1) |(df_01['C']>0)]

         A  B   C
2 Linha  2 -2  10
3 Linha  3 -1  20

In [58]:
df_01.reset_index()

     index  A  B   C
0  1 Linha  1 -3   0
1  2 Linha  2 -2  10
2  3 Linha  3 -1  20

In [63]:
df_01

     index  A  B   C
0  1 Linha  1 -3   0
1  2 Linha  2 -2  10
2  3 Linha  3 -1  20

In [60]:
df_01.reset_index(inplace=True)

In [62]:
df_01

     index  A  B   C
0  1 Linha  1 -3   0
1  2 Linha  2 -2  10
2  3 Linha  3 -1  20

In [64]:
df_01.drop('index', axis=1, inplace=True)

In [65]:
df_01

   A  B   C
0  1 -3   0
1  2 -2  10
2  3 -1  20

In [67]:
dicionario02A = {
    'A': [1,2,3],
    'B': [-32, -21, -15],
    'C': [60,10,20],
    'Chave': ['AA', 'BB', 'CC']
}

dicionario02B = {
    'A': [6,7,8],
    'B': [-39, -28, -17],
    'C': [1000,10,60],
    'Chave': ['AA', 'BB', 'CC']
}

dicionario02C = {
    'A': [11, 12, 13],
    'B': [-39, -22, -11],
    'C': [30,10,20],
    'Chave': ['AA', 'BB', 'CC']
}

label_01 = ['1 Linha', '2 Linha', '3 Linha']
label_02 = ['4 Linha', '5 Linha', '6 Linha']
label_03 = ['7 Linha', '8 Linha', '9 Linha']

In [68]:
df_03a = pd.DataFrame(dicionario02A)
df_03b = pd.DataFrame(dicionario02B)
df_03c = pd.DataFrame(dicionario02C)

In [69]:
df_03a

   A   B   C Chave
0  1 -32  60    AA
1  2 -21  10    BB
2  3 -15  20    CC

In [71]:
pd.concat([df_03a, df_03b, df_03c])

    A   B     C Chave
0   1 -32    60    AA
1   2 -21    10    BB
2   3 -15    20    CC
0   6 -39  1000    AA
1   7 -28    10    BB
2   8 -17    60    CC
0  11 -39    30    AA
1  12 -22    10    BB
2  13 -11    20    CC

In [73]:
pd.merge(df_03a, df_03b, how='inner', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [74]:
pd.merge(df_03a, df_03b, how='left', on='Chave')

   A_x  B_x  C_x Chave  A_y  B_y   C_y
0    1  -32   60    AA    6  -39  1000
1    2  -21   10    BB    7  -28    10
2    3  -15   20    CC    8  -17    60

In [76]:
dic1 = {
    'A':[1,2,3],
    'B':[-32,-21,-15],
    'C':[60,10,20]
}

dic2={
    'D':[6,7,8],
    'E':[-39,-28,-27],
    'F':[1000,10,60]
}

Label_01a = ['1ª Linha','2ª Linha','3ª Linha']

df01 = pd.DataFrame(dic1,index= Label_01a)
df02 = pd.DataFrame(dic2,index= Label_01a)

In [77]:
df01.join(df02)

          A   B   C  D   E     F
1ª Linha  1 -32  60  6 -39  1000
2ª Linha  2 -21  10  7 -28    10
3ª Linha  3 -15  20  8 -27    60